// Задача 10
// Напишите программу, которая принимает на вход трёхзначное число и на выходе показывает вторую цифру этого числа. Решаем с помощью "/" и "%", со строками не работаем
// 456 -> 5
// 782 -> 8
// 918 -> 1

// РЕШЕНИЕ:

// Console.WriteLine("Введите трехзначное число: ");
// int num = int.Parse(Console.ReadLine());
// int num1 = num%100;
// int num2 = num1/10;
// Console.WriteLine($"Показывает второе число {num2} ");




